# 바탕화면 정리
# wallpaper : 컴퓨터 바탕화면의 상태를 나타낸 문자열 배열
# 최소한의 드래그 위치.

# [".#...", "..#..", "...#."]	[0, 1, 3, 4]
# ["..........", ".....#....", "......##..", "...##.....", "....#....."]	[1, 3, 5, 8]
# [".##...##.", "#..#.#..#", "#...#...#", ".#.....#.", "..#...#..", "...#.#...", "....#...."]	[0, 0, 7, 9]
# ["..", "#."]	[1, 0, 2, 1]
# ["..#..", ".#...", "..##.", "....#"]


wallpaper = ["..#..", ".#...", "..##.", "....#"]
a=[]
b=[]

for i, val1 in enumerate(wallpaper):
    for j, val2 in enumerate(val1):
        if val2 == "#":
            a.append(i)
            b.append(j)

a_li = sorted(a)
b_li = sorted(b)

result = [a_li[0], b_li[0], a_li[len(a_li)-1]+1, b_li[len(b_li)-1]+1]
print(result)